### Terraform "dev"
#### Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.documenso_database.random_string.random_2: Refreshing state... [id=C29tmELRhdFCzB456j65j0cH]
module.documenso_database.random_password.random_password: Refreshing state... [id=none]
module.documenso_database.random_string.random_1: Refreshing state... [id=rbzznpnlpmzyqlwmlcvjelzj]
module.documenso_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-custom-policy-attachment: Refreshing state... [id=ecsExecutionRole-signezily-dev-20250122235151844400000001]
module.documenso.aws_lb_listener.redirect[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/660fc083b5bb4ed0]
module.documenso_execution_role.aws_iam_policy.custom_policy: Refreshing state... [id=arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev]
module.documenso_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment[0]: Refreshing state... [id=ecsExecutionRole-signezily-dev-20250122235151860200000002]
aws_secretsmanager_secret.documenso: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu]
module.documenso.aws_security_group_rule.ecs_tasks_ingress["3000"]: Refreshing state... [id=sgrule-1760459262]
module.documenso.aws_security_group.lb[0]: Refreshing state... [id=sg-028be806c1c0271ff]
module.documenso.aws_cloudwatch_log_group.tasks[0]: Refreshing state... [id=/ecs/dev/signezily/app]
module.documenso.aws_lb_listener.main["443"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78]
module.documenso.aws_security_group_rule.lb_redirect[0]: Refreshing state... [id=sgrule-2817597403]
module.documenso_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE]
aws_ecs_task_definition.documenso: Refreshing state... [id=signezily-dev]
module.documenso_database.aws_secretsmanager_secret_version.sversion: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE|D4A9EB78-BBD8-4857-8150-4CE347A7E5FA]
module.documenso.aws_lb_listener_rule.marketing_site_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/9c336586b5a254cb]
module.documenso.aws_lb_target_group.marketing_site_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4]
module.documenso.aws_lb_target_group.documentation_site_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba]
module.documenso_execution_role.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecsExecutionRole-signezily-dev]
module.documenso.aws_lb_listener_rule.documentation_site_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/72c663fd6fa15e6d]
module.documenso_database.aws_db_instance.postgres: Refreshing state... [id=dev-signezily-20250123000200045200000001]
module.documenso.aws_lb_target_group.main["3000"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d]
module.documenso.aws_security_group_rule.lb_ingress["443"]: Refreshing state... [id=sgrule-1239929890]
module.documenso.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f]
module.documenso.aws_ecs_service.main_given_task: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:898622234277:service/data/signezily-app-dev]
module.documenso.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0de70c30958aa261f]
data.aws_security_groups.postgres: Reading...
module.signezily.data.aws_region.current: Reading...
module.signezily.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_vpcs.prod: Reading...
data.aws_db_subnet_group.rds: Reading...
aws_secretsmanager_secret_version.sversion: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu|5E61F51B-6B3B-47C9-98C7-CAAC9AC98037]
data.aws_vpcs.prod: Read complete after 1s [id=ap-northeast-1]
data.aws_vpc.prod: Reading...
data.aws_security_groups.postgres: Read complete after 1s [id=ap-northeast-1]
data.aws_db_subnet_group.rds: Read complete after 1s [id=main]
data.aws_vpc.prod: Read complete after 0s [id=vpc-02eed9d0b0daadb6a]
data.aws_subnets.prod_public: Reading...
data.aws_security_groups.outbound_everywhere: Reading...
data.aws_subnets.prod_private: Reading...
data.aws_security_groups.outbound_everywhere: Read complete after 0s [id=ap-northeast-1]
data.aws_subnets.prod_public: Read complete after 1s [id=ap-northeast-1]
module.signezily.data.aws_subnet.lb_subnets["2"]: Reading...
module.signezily.data.aws_subnet.lb_subnets["0"]: Reading...
module.signezily.data.aws_subnet.lb_subnets["1"]: Reading...
data.aws_subnets.prod_private: Read complete after 1s [id=ap-northeast-1]
module.signezily.data.aws_subnet.lb_subnets["2"]: Read complete after 0s [id=subnet-00096d0dc685bc70b]
module.signezily.data.aws_subnet.lb_subnets["0"]: Read complete after 0s [id=subnet-072c04c7bef15119a]
module.signezily.data.aws_subnet.lb_subnets["1"]: Read complete after 0s [id=subnet-0686f32cf61665fdc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.documenso will be destroyed
  # (because aws_ecs_task_definition.documenso is not in configuration)
  - resource "aws_ecs_task_definition" "documenso" {
      - arn                      = "arn:aws:ecs:ap-northeast-1:898622234277:task-definition/signezily-dev:1" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "898622234277.dkr.ecr.ap-northeast-1.amazonaws.com/signezily:app_latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev/signezily/app"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "signezily"
                        }
                    }
                  - mountPoints      = []
                  - name             = "app"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEXTAUTH_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXTAUTH_URL::"
                        },
                      - {
                          - name      = "NEXTAUTH_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXTAUTH_SECRET::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_WEBAPP_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PUBLIC_WEBAPP_URL::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_MARKETING_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PUBLIC_MARKETING_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_DATABASE_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_DIRECT_DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_DIRECT_DATABASE_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_ENCRYPTION_KEY::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_ENCRYPTION_SECONDARY_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_ENCRYPTION_SECONDARY_KEY::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_TRANSPORT"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_TRANSPORT::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_HOST::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_PORT"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_PORT::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_USERNAME::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_PASSWORD::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_SECURE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_SECURE::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_FROM_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_FROM_NAME::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_FROM_ADDRESS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_FROM_ADDRESS::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SIGNING_LOCAL_FILE_CONTENTS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SIGNING_LOCAL_FILE_CONTENTS::"
                        },
                      - {
                          - name      = "SIGN_CERT_FILE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_CERT_FILE::"
                        },
                      - {
                          - name      = "SIGN_PRIV_KEY_FILE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_PRIV_KEY_FILE::"
                        },
                      - {
                          - name      = "SIGN_PRIV_KEY_PASS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_PRIV_KEY_PASS::"
                        },
                      - {
                          - name      = "SIGN_CERT_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_CERT_NAME::"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PORT"
                          - value = "3001"
                        },
                    ]
                  - essential        = true
                  - image            = "898622234277.dkr.ecr.ap-northeast-1.amazonaws.com/signezily:marketing_latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev/signezily/app"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "signezily"
                        }
                    }
                  - mountPoints      = []
                  - name             = "marketing"
                  - portMappings     = [
                      - {
                          - containerPort = 3001
                          - hostPort      = 3001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEXTAUTH_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXTAUTH_URL::"
                        },
                      - {
                          - name      = "NEXTAUTH_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXTAUTH_SECRET::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_WEBAPP_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PUBLIC_WEBAPP_URL::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_MARKETING_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PUBLIC_MARKETING_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_DATABASE_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_DIRECT_DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_DIRECT_DATABASE_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_ENCRYPTION_KEY::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_ENCRYPTION_SECONDARY_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_ENCRYPTION_SECONDARY_KEY::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_TRANSPORT"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_TRANSPORT::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_HOST::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_PORT"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_PORT::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_USERNAME::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_PASSWORD::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_SECURE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_SECURE::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_FROM_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_FROM_NAME::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_FROM_ADDRESS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_FROM_ADDRESS::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SIGNING_LOCAL_FILE_CONTENTS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SIGNING_LOCAL_FILE_CONTENTS::"
                        },
                      - {
                          - name      = "SIGN_CERT_FILE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_CERT_FILE::"
                        },
                      - {
                          - name      = "SIGN_PRIV_KEY_FILE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_PRIV_KEY_FILE::"
                        },
                      - {
                          - name      = "SIGN_PRIV_KEY_PASS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_PRIV_KEY_PASS::"
                        },
                      - {
                          - name      = "SIGN_CERT_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_CERT_NAME::"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PORT"
                          - value = "3002"
                        },
                    ]
                  - essential        = true
                  - image            = "898622234277.dkr.ecr.ap-northeast-1.amazonaws.com/signezily:docs_latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev/signezily/app"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "signezily"
                        }
                    }
                  - mountPoints      = []
                  - name             = "documentation"
                  - portMappings     = [
                      - {
                          - containerPort = 3002
                          - hostPort      = 3002
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEXTAUTH_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXTAUTH_URL::"
                        },
                      - {
                          - name      = "NEXTAUTH_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXTAUTH_SECRET::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_WEBAPP_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PUBLIC_WEBAPP_URL::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_MARKETING_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PUBLIC_MARKETING_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_DATABASE_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_DIRECT_DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_DIRECT_DATABASE_URL::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_ENCRYPTION_KEY::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_ENCRYPTION_SECONDARY_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_ENCRYPTION_SECONDARY_KEY::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_TRANSPORT"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_TRANSPORT::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_HOST::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_PORT"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_PORT::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_USERNAME::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_PASSWORD::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_SECURE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_SECURE::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_FROM_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_FROM_NAME::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SMTP_FROM_ADDRESS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SMTP_FROM_ADDRESS::"
                        },
                      - {
                          - name      = "NEXT_PRIVATE_SIGNING_LOCAL_FILE_CONTENTS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:NEXT_PRIVATE_SIGNING_LOCAL_FILE_CONTENTS::"
                        },
                      - {
                          - name      = "SIGN_CERT_FILE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_CERT_FILE::"
                        },
                      - {
                          - name      = "SIGN_PRIV_KEY_FILE"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_PRIV_KEY_FILE::"
                        },
                      - {
                          - name      = "SIGN_PRIV_KEY_PASS"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_PRIV_KEY_PASS::"
                        },
                      - {
                          - name      = "SIGN_CERT_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu:SIGN_CERT_NAME::"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "1024" -> null
      - execution_role_arn       = "arn:aws:iam::898622234277:role/ecsExecutionRole-signezily-dev" -> null
      - family                   = "signezily-dev" -> null
      - id                       = "signezily-dev" -> null
      - memory                   = "2048" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 1 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - task_role_arn            = "arn:aws:iam::898622234277:role/ecsExecutionRole-signezily-dev" -> null
    }

  # aws_ecs_task_definition.signezily will be created
  + resource "aws_ecs_task_definition" "signezily" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "signezily-dev"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_secretsmanager_secret.documenso will be destroyed
  # (because aws_secretsmanager_secret.documenso is not in configuration)
  - resource "aws_secretsmanager_secret" "documenso" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu" -> null
      - name                           = "dev/signezily" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
    }

  # aws_secretsmanager_secret.signezily will be created
  + resource "aws_secretsmanager_secret" "signezily" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev/signezily"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
    }

  # aws_secretsmanager_secret_version.sversion must be replaced
-/+ resource "aws_secretsmanager_secret_version" "sversion" {
      ~ arn            = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu|5E61F51B-6B3B-47C9-98C7-CAAC9AC98037" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu" # forces replacement -> (known after apply) # forces replacement
      ~ version_id     = "5E61F51B-6B3B-47C9-98C7-CAAC9AC98037" -> (known after apply)
      ~ version_stages = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.documenso.aws_cloudwatch_log_group.tasks[0] will be destroyed
  # (because aws_cloudwatch_log_group.tasks is not in configuration)
  - resource "aws_cloudwatch_log_group" "tasks" {
      - arn               = "arn:aws:logs:ap-northeast-1:898622234277:log-group:/ecs/dev/signezily/app" -> null
      - id                = "/ecs/dev/signezily/app" -> null
      - name              = "/ecs/dev/signezily/app" -> null
      - retention_in_days = 90 -> null
      - tags              = {} -> null
      - tags_all          = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
    }

  # module.documenso.aws_ecs_service.main_given_task will be destroyed
  # (because aws_ecs_service.main_given_task is not in configuration)
  - resource "aws_ecs_service" "main_given_task" {
      - cluster                            = "arn:aws:ecs:ap-northeast-1:898622234277:cluster/data" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "aws-service-role" -> null
      - id                                 = "arn:aws:ecs:ap-northeast-1:898622234277:service/data/signezily-app-dev" -> null
      - name                               = "signezily-app-dev" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - task_definition                    = "arn:aws:ecs:ap-northeast-1:898622234277:task-definition/signezily-dev:1" -> null
      - wait_for_steady_state              = false -> null

      - capacity_provider_strategy {
          - base              = 0 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }
      - capacity_provider_strategy {
          - base              = 1 -> null
          - capacity_provider = "FARGATE_SPOT" -> null
          - weight            = 14 -> null
        }

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "app" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d" -> null
        }
      - load_balancer {
          - container_name   = "documentation" -> null
          - container_port   = 3002 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba" -> null
        }
      - load_balancer {
          - container_name   = "marketing" -> null
          - container_port   = 3001 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0de70c30958aa261f",
            ] -> null
          - subnets          = [
              - "subnet-016d8b087f59eb91b",
              - "subnet-04a66e0ebd039a866",
              - "subnet-07f3ef2494dc623e1",
            ] -> null
        }
    }

  # module.documenso.aws_lb.main will be destroyed
  # (because aws_lb.main is not in configuration)
  - resource "aws_lb" "main" {
      - arn                              = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f" -> null
      - arn_suffix                       = "app/signezily-dev/0911cf51887b382f" -> null
      - desync_mitigation_mode           = "defensive" -> null
      - dns_name                         = "signezily-dev-1489265167.ap-northeast-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields       = false -> null
      - enable_cross_zone_load_balancing = true -> null
      - enable_deletion_protection       = false -> null
      - enable_http2                     = true -> null
      - enable_waf_fail_open             = false -> null
      - id                               = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f" -> null
      - idle_timeout                     = 60 -> null
      - internal                         = false -> null
      - ip_address_type                  = "ipv4" -> null
      - load_balancer_type               = "application" -> null
      - name                             = "signezily-dev" -> null
      - preserve_host_header             = false -> null
      - security_groups                  = [
          - "sg-028be806c1c0271ff",
        ] -> null
      - subnets                          = [
          - "subnet-00096d0dc685bc70b",
          - "subnet-0686f32cf61665fdc",
          - "subnet-072c04c7bef15119a",
        ] -> null
      - tags                             = {} -> null
      - tags_all                         = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - vpc_id                           = "vpc-02eed9d0b0daadb6a" -> null
      - zone_id                          = "Z14GRHDCWA56QT" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-00096d0dc685bc70b" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0686f32cf61665fdc" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-072c04c7bef15119a" -> null
        }
    }

  # module.documenso.aws_lb_listener.main["443"] will be destroyed
  # (because aws_lb_listener.main is not in configuration)
  - resource "aws_lb_listener" "main" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78" -> null
      - certificate_arn   = "arn:aws:acm:ap-northeast-1:898622234277:certificate/f926aa8b-39df-4849-be62-297fb131be27" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f" -> null
      - port              = 443 -> null
      - protocol          = "HTTPS" -> null
      - ssl_policy        = "ELBSecurityPolicy-2016-08" -> null
      - tags              = {} -> null
      - tags_all          = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d" -> null
          - type             = "forward" -> null
        }
    }

  # module.documenso.aws_lb_listener.redirect[0] will be destroyed
  # (because aws_lb_listener.redirect is not in configuration)
  - resource "aws_lb_listener" "redirect" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/660fc083b5bb4ed0" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/660fc083b5bb4ed0" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.documenso.aws_lb_listener_rule.documentation_site_rule will be destroyed
  # (because aws_lb_listener_rule.documentation_site_rule is not in configuration)
  - resource "aws_lb_listener_rule" "documentation_site_rule" {
      - arn          = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/72c663fd6fa15e6d" -> null
      - id           = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/72c663fd6fa15e6d" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78" -> null
      - priority     = 201 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "docs-dev.sign.ezily.io",
                ] -> null
            }
        }
    }

  # module.documenso.aws_lb_listener_rule.marketing_site_rule will be destroyed
  # (because aws_lb_listener_rule.marketing_site_rule is not in configuration)
  - resource "aws_lb_listener_rule" "marketing_site_rule" {
      - arn          = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/9c336586b5a254cb" -> null
      - id           = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/9c336586b5a254cb" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78" -> null
      - priority     = 200 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "sign-dev.ezily.io",
                ] -> null
            }
        }
    }

  # module.documenso.aws_lb_target_group.documentation_site_tg will be destroyed
  # (because aws_lb_target_group.documentation_site_tg is not in configuration)
  - resource "aws_lb_target_group" "documentation_site_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba" -> null
      - arn_suffix                         = "targetgroup/dev-documentation-site-tg/bb2241051a57baba" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "dev-documentation-site-tg" -> null
      - port                               = 3002 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-02eed9d0b0daadb6a" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "3002" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.documenso.aws_lb_target_group.main["3000"] will be destroyed
  # (because aws_lb_target_group.main is not in configuration)
  - resource "aws_lb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d" -> null
      - arn_suffix                         = "targetgroup/signezily-app-dev-3000/4516eb02e93f266d" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "signezily-app-dev-3000" -> null
      - port                               = 3000 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-02eed9d0b0daadb6a" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/api/health" -> null
          - port                = "3000" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.documenso.aws_lb_target_group.marketing_site_tg will be destroyed
  # (because aws_lb_target_group.marketing_site_tg is not in configuration)
  - resource "aws_lb_target_group" "marketing_site_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4" -> null
      - arn_suffix                         = "targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "dev-marketing-site-tg" -> null
      - port                               = 3001 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-02eed9d0b0daadb6a" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "3001" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.documenso.aws_security_group.ecs_tasks will be destroyed
  # (because aws_security_group.ecs_tasks is not in configuration)
  - resource "aws_security_group" "ecs_tasks" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:898622234277:security-group/sg-0de70c30958aa261f" -> null
      - description            = "allow inbound access from the ALB only" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0de70c30958aa261f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "LB to Task:3000 (app:3000:3000)"
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-028be806c1c0271ff",
                ]
              - self             = false
              - to_port          = 3000
            },
          - {
              - cidr_blocks      = []
              - description      = "LB to Task:3000 (app:3000:3000)"
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-028be806c1c0271ff",
                ]
              - self             = false
              - to_port          = 3002
            },
        ] -> null
      - name                   = "signezily-app-dev-ecs-tasks" -> null
      - owner_id               = "898622234277" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - vpc_id                 = "vpc-02eed9d0b0daadb6a" -> null
    }

  # module.documenso.aws_security_group.lb[0] will be destroyed
  # (because aws_security_group.lb is not in configuration)
  - resource "aws_security_group" "lb" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:898622234277:security-group/sg-028be806c1c0271ff" -> null
      - description            = "controls access to the ALB" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-028be806c1c0271ff" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Ingress to LB from 443 (app:3000:3000)"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Ingress to LB from 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "signezily-app-dev-ecs-alb" -> null
      - owner_id               = "898622234277" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - vpc_id                 = "vpc-02eed9d0b0daadb6a" -> null
    }

  # module.documenso.aws_security_group_rule.ecs_tasks_ingress["3000"] will be destroyed
  # (because aws_security_group_rule.ecs_tasks_ingress is not in configuration)
  - resource "aws_security_group_rule" "ecs_tasks_ingress" {
      - description              = "LB to Task:3000 (app:3000:3000)" -> null
      - from_port                = 3000 -> null
      - id                       = "sgrule-1760459262" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0de70c30958aa261f" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-028be806c1c0271ff" -> null
      - to_port                  = 3000 -> null
      - type                     = "ingress" -> null
    }

  # module.documenso.aws_security_group_rule.lb_ingress["443"] will be destroyed
  # (because aws_security_group_rule.lb_ingress is not in configuration)
  - resource "aws_security_group_rule" "lb_ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Ingress to LB from 443 (app:3000:3000)" -> null
      - from_port         = 443 -> null
      - id                = "sgrule-1239929890" -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-028be806c1c0271ff" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }

  # module.documenso.aws_security_group_rule.lb_redirect[0] will be destroyed
  # (because aws_security_group_rule.lb_redirect is not in configuration)
  - resource "aws_security_group_rule" "lb_redirect" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Ingress to LB from 80" -> null
      - from_port         = 80 -> null
      - id                = "sgrule-2817597403" -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-028be806c1c0271ff" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.documenso_database.aws_db_instance.postgres will be destroyed
  # (because aws_db_instance.postgres is not in configuration)
  - resource "aws_db_instance" "postgres" {
      - address                               = "dev-signezily-20250123000200045200000001.cazglawa3sru.ap-northeast-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - arn                                   = "arn:aws:rds:ap-northeast-1:898622234277:db:dev-signezily-20250123000200045200000001" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "ap-northeast-1c" -> null
      - backup_retention_period               = 30 -> null
      - backup_window                         = "09:30-10:00" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - db_name                               = "signezily" -> null
      - db_subnet_group_name                  = "main" -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "dev-signezily-20250123000200045200000001.cazglawa3sru.ap-northeast-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "13.15" -> null
      - engine_version_actual                 = "13.15" -> null
      - final_snapshot_identifier             = "snapshot-rbzznpnlpmzyqlwmlcvjelzj" -> null
      - hosted_zone_id                        = "Z24O6O9L7SGTNB" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "dev-signezily-20250123000200045200000001" -> null
      - identifier                            = "dev-signezily-20250123000200045200000001" -> null
      - identifier_prefix                     = "dev-signezily-" -> null
      - instance_class                        = "db.t3.micro" -> null
      - iops                                  = 0 -> null
      - latest_restorable_time                = "2025-02-20T14:49:35Z" -> null
      - license_model                         = "postgresql-license" -> null
      - maintenance_window                    = "fri:14:38-fri:15:08" -> null
      - max_allocated_storage                 = 100 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = false -> null
      - name                                  = "signezily" -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:postgres-13" -> null
      - parameter_group_name                  = "default.postgres13" -> null
      - password                              = (sensitive value) -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-VBZMYJTNFKM4HRVMB5GEMCIYTY" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = false -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - username                              = "postgres" -> null
      - vpc_security_group_ids                = [
          - "sg-0af55a137097344ca",
        ] -> null
    }

  # module.documenso_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds will be destroyed
  # (because aws_secretsmanager_secret.aws_secretsmanager_secret_rds is not in configuration)
  - resource "aws_secretsmanager_secret" "aws_secretsmanager_secret_rds" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE" -> null
      - name                           = "signezily_rds_C29tmELRhdFCzB456j65j0cH" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
    }

  # module.documenso_database.aws_secretsmanager_secret_version.sversion will be destroyed
  # (because aws_secretsmanager_secret_version.sversion is not in configuration)
  - resource "aws_secretsmanager_secret_version" "sversion" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE|D4A9EB78-BBD8-4857-8150-4CE347A7E5FA" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_C29tmELRhdFCzB456j65j0cH-l7m3iE" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "D4A9EB78-BBD8-4857-8150-4CE347A7E5FA" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.documenso_database.random_password.random_password will be destroyed
  # (because random_password.random_password is not in configuration)
  - resource "random_password" "random_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.documenso_database.random_string.random_1 will be destroyed
  # (because random_string.random_1 is not in configuration)
  - resource "random_string" "random_1" {
      - id          = "rbzznpnlpmzyqlwmlcvjelzj" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 24 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "rbzznpnlpmzyqlwmlcvjelzj" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.documenso_database.random_string.random_2 will be destroyed
  # (because random_string.random_2 is not in configuration)
  - resource "random_string" "random_2" {
      - id          = "C29tmELRhdFCzB456j65j0cH" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 6 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "C29tmELRhdFCzB456j65j0cH" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.documenso_execution_role.aws_iam_policy.custom_policy will be destroyed
  # (because aws_iam_policy.custom_policy is not in configuration)
  - resource "aws_iam_policy" "custom_policy" {
      - arn         = "arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev" -> null
      - description = "Custom policy for ECS task role." -> null
      - id          = "arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev" -> null
      - name        = "AmazonECSExecutionRole_CustomPolicy_signezily_dev" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                          - "secretsmanager:ListSecrets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ses:SendEmail",
                          - "ses:SendRawEmail",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA5COQPD2S6LAYYP5IU" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
    }

  # module.documenso_execution_role.aws_iam_role.ecs_task_execution_role will be destroyed
  # (because aws_iam_role.ecs_task_execution_role is not in configuration)
  - resource "aws_iam_role" "ecs_task_execution_role" {
      - arn                   = "arn:aws:iam::898622234277:role/ecsExecutionRole-signezily-dev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-01-22T23:51:51Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecsExecutionRole-signezily-dev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecsExecutionRole-signezily-dev" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "App"         = "signezily"
          - "Automation"  = "Terraform"
          - "Environment" = "dev"
        } -> null
      - unique_id             = "AROA5COQPD2SY4OUKQ5DO" -> null
    }

  # module.documenso_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-custom-policy-attachment will be destroyed
  # (because aws_iam_role_policy_attachment.ecs-task-execution-role-custom-policy-attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-custom-policy-attachment" {
      - id         = "ecsExecutionRole-signezily-dev-20250122235151844400000001" -> null
      - policy_arn = "arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev" -> null
      - role       = "ecsExecutionRole-signezily-dev" -> null
    }

  # module.documenso_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment[0] will be destroyed
  # (because aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      - id         = "ecsExecutionRole-signezily-dev-20250122235151860200000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "ecsExecutionRole-signezily-dev" -> null
    }

  # module.signezily.aws_cloudwatch_log_group.tasks[0] will be created
  + resource "aws_cloudwatch_log_group" "tasks" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/dev/signezily/app"
      + retention_in_days = 90
      + tags_all          = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
    }

  # module.signezily.aws_ecs_service.main_given_task will be created
  + resource "aws_ecs_service" "main_given_task" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:898622234277:cluster/data"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "signezily-app-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 14
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "documentation"
          + container_port   = 3002
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "marketing"
          + container_port   = 3001
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-016d8b087f59eb91b",
              + "subnet-04a66e0ebd039a866",
              + "subnet-07f3ef2494dc623e1",
            ]
        }
    }

  # module.signezily.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "signezily-dev"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-00096d0dc685bc70b",
          + "subnet-0686f32cf61665fdc",
          + "subnet-072c04c7bef15119a",
        ]
      + tags_all                   = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.signezily.aws_lb_listener.main["443"] will be created
  + resource "aws_lb_listener" "main" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-1:898622234277:certificate/f926aa8b-39df-4849-be62-297fb131be27"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.signezily.aws_lb_listener.redirect[0] will be created
  + resource "aws_lb_listener" "redirect" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.signezily.aws_lb_listener_rule.documentation_site_rule will be created
  + resource "aws_lb_listener_rule" "documentation_site_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 201
      + tags_all     = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "docs.sign.ezily.io",
                ]
            }
        }
    }

  # module.signezily.aws_lb_listener_rule.marketing_site_rule will be created
  + resource "aws_lb_listener_rule" "marketing_site_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags_all     = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "sign.ezily.io",
                ]
            }
        }
    }

  # module.signezily.aws_lb_target_group.documentation_site_tg will be created
  + resource "aws_lb_target_group" "documentation_site_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "dev-documentation-site-tg"
      + port                               = 3002
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02eed9d0b0daadb6a"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "3002"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.signezily.aws_lb_target_group.main["3000"] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "signezily-app-dev-3000"
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02eed9d0b0daadb6a"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/api/health"
          + port                = "3000"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.signezily.aws_lb_target_group.marketing_site_tg will be created
  + resource "aws_lb_target_group" "marketing_site_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "dev-marketing-site-tg"
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02eed9d0b0daadb6a"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "3001"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.signezily.aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "allow inbound access from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "signezily-app-dev-ecs-tasks"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + vpc_id                 = "vpc-02eed9d0b0daadb6a"
    }

  # module.signezily.aws_security_group.lb[0] will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "controls access to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "signezily-app-dev-ecs-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + vpc_id                 = "vpc-02eed9d0b0daadb6a"
    }

  # module.signezily.aws_security_group_rule.ecs_tasks_ingress["3000"] will be created
  + resource "aws_security_group_rule" "ecs_tasks_ingress" {
      + description              = "LB to Task:3000 (app:3000:3000)"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # module.signezily.aws_security_group_rule.lb_ingress["443"] will be created
  + resource "aws_security_group_rule" "lb_ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress to LB from 443 (app:3000:3000)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.signezily.aws_security_group_rule.lb_redirect[0] will be created
  + resource "aws_security_group_rule" "lb_redirect" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress to LB from 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.signezily_database.aws_db_instance.postgres will be created
  + resource "aws_db_instance" "postgres" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 30
      + backup_window                         = "09:30-10:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "signezily"
      + db_subnet_group_name                  = "main"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.15"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "dev-signezily-"
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0af55a137097344ca",
        ]
    }

  # module.signezily_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds will be created
  + resource "aws_secretsmanager_secret" "aws_secretsmanager_secret_rds" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
    }

  # module.signezily_database.aws_secretsmanager_secret_version.sversion will be created
  + resource "aws_secretsmanager_secret_version" "sversion" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.signezily_database.random_password.random_password will be created
  + resource "random_password" "random_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.signezily_database.random_string.random_1 will be created
  + resource "random_string" "random_1" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 24
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.signezily_database.random_string.random_2 will be created
  + resource "random_string" "random_2" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 3
      + min_numeric = 6
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.signezily_execution_role.aws_iam_policy.custom_policy will be created
  + resource "aws_iam_policy" "custom_policy" {
      + arn         = (known after apply)
      + description = "Custom policy for ECS task role."
      + id          = (known after apply)
      + name        = "AmazonECSExecutionRole_CustomPolicy_signezily_dev"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecrets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
    }

  # module.signezily_execution_role.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecsExecutionRole-signezily-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "App"         = "signezily"
          + "Automation"  = "Terraform"
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)
    }

  # module.signezily_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-custom-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-custom-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecsExecutionRole-signezily-dev"
    }

  # module.signezily_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecsExecutionRole-signezily-dev"
    }

Plan: 28 to add, 0 to change, 28 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

*Pusher: @gmoraa, Action: `pull_request`*